dll "qm.exe" #DetectStringEncoding $s ;;returns: 0 ASCII, 1 UTF8, 2 other
out

 str s="abc"
 str s="ąčęž"
 str s="ąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąč ąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąč ąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąč ąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąčęąč "
 str s="ab[150]c" ;;bad
 str s="ab[0xc2][0x88]c" ;;good
 str s="ab[0xc2][0x78]c" ;;bad
 str s="ab[0xe0][0x88][0x88]c" ;;good
 str s="ab[0xe0][0x88]c" ;;bad
 str s="ab[0xe0][0x88][0xc8]c" ;;bad
 str s="ab[0xe0][0x88][0x88][0x88]c" ;;bad

out DetectStringEncoding(s)
